Core/src/DataProcessors/СинхронизацияЭлектронныхТТН/СинхронизацияЭлектронныхТТН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СинхронизацияЭлектронныхТТН</name>
  <tabularSections>
    <name>ТоварныеНакладныеНаПортале</name>
    <attributes>
      <name>ACTIVATE_DATE</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>BEGIN_DATE</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>BUYER_NAME</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BUYER_TIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CAR_NUMBER</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CLOSE_DATE</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>CREATE_DATE</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>DELIVERY_DATE</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>DRIVER_TIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>END_ADDRESS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FULL_AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IS_CONFIRMED</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>PAR_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RECIEVER_INFO</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RECEPTION_INFO</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SELLER_NAME</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SELLER_TIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>START_ADDRESS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>STATUS</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>S_USER_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TRANSPORT_COAST</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TYPE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WAYBILL_COMMENT</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>WAYBILL_NUMBER</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусТН</name>
      <type>
        <types>EnumRef.СтатусыВыписанныхТТН</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьОшибки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеЗапасов</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеВА</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипыТТН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Полученный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупатель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьТоварыВДокументе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьУслугиВДокументе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПревязан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСинхронизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаСтатуса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтаИмущество</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыНаПортале</name>
    <attributes>
      <name>IDНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>W_NAME</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_TXT</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BAR_CODE</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PRICE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиRS</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VAT_TYPE</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>TIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>WAYBILL_NUMBER</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Полученный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СозданныеДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеЗапасов</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеВА</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/InformationRegisters/ЦеныНоменклатурыКонтрагентов/ЦеныНоменклатурыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыКонтрагентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦенКонтрагента</name>
    <type>
      <types>CatalogRef.ВидыЦенКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>ВключаяХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/DataProcessors/СинхронизацияЭлектронныхТТН/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтавкаНДС18 = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18"));
	ИспользоватьДокументыВА = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьДокументыВАДляЭлектронныхНакладных");
	Элементы.ТоварныеНакладныеНаПорталеЭтаИмущество.Видимость = ИспользоватьДокументыВА;
	
	Полученный						= Истина;
	СтатусТТНАктивный				= Истина;
	ВнутреннееПеремещение 			= Истина;
	РеализацияСТранспортировкой		= Истина;
	РеализацияБезТранспортировки	= Истина;
	Дистрибуция 					= Ложь;
	ВозвратПокупателяПокупателю 	= Истина;
	ПодчиненнаяТН					= Ложь;
	
	ДатаКон 			= ТекущаяДата();
	ДатаНач 			= ДатаКон - 86400*2;
	НациональнаяВалюта 	= УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		Пользователи.ТекущийПользователь(),
		"ОсновнаяОрганизация");
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Организация = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.Организации.ОсновнаяОрганизация");
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьСоответствиеНоменклатуры();
	УчетЦенКонтрагентов = ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов");
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьСоответствиеНоменклатуры();
КонецПроцедуры
&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	
	ДанныеНеСоответствуютФильтру = Истина;
	УстановитьТекстПодсказки();
	
КонецПроцедуры
&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	
	ДанныеНеСоответствуютФильтру = Истина;
	УстановитьТекстПодсказки();
	
КонецПроцедуры
&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	ДанныеНеСоответствуютФильтру = Истина;
	УстановитьТекстПодсказки();
	
КонецПроцедуры
&НаКлиенте
Процедура ТоварныеНакладныеНаПорталеКонтрагентПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТоварныеНакладныеНаПортале.ТекущиеДанные;
	ПоставщикПокупатель = УправлениеНебольшойФирмойСервер.ЗначенияРеквизитовОбъекта(ТекДанные.Контрагент, "Поставщик,Покупатель");
	ТекДанные.Поставщик		= ПоставщикПокупатель.Поставщик;
	ТекДанные.Покупатель	= ПоставщикПокупатель.Покупатель;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ОчиститьСообщения();
	ОбновитьДанныеНаСервере();
	
КонецПроцедуры
&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	Объект.ТоварныеНакладныеНаПортале.Очистить();
	Объект.ТоварыНаПортале.Очистить();
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сообщить(НСтр("ka='არ არის შევსებული შევსებული ველი ""ორგანიზაცია"".';ru='Не заполнен поле ""Организация""'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаНач) Или Не ЗначениеЗаполнено(ДатаКон) Тогда
		Сообщить(НСтр("ka='არ არის შევსებული პერიოდი';ru='Не заполнен период'"));
		Возврат;
	КонецЕсли;
	
	Колво = 0;
	ТаблицаНакладных		= Объект.ТоварныеНакладныеНаПортале.Выгрузить();
	ТаблицаТоварыНакладных	= Объект.ТоварыНаПортале.Выгрузить();
	ИННКонтрагента			= СокрЛП(Контрагент.ИНН);
	itypes = "";
	Если ВнутреннееПеремещение 			Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",1", "1"); КонецЕсли;//1 გადაადგილება
	Если РеализацияСТранспортировкой 	Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",2", "2"); КонецЕсли;//2 რეალიზაცია ტრანსპორტირებით
	Если РеализацияБезТранспортировки 	Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",3", "3"); КонецЕсли;//3 რეალიზაცია ტრანსპორტირების გარეშე
	Если Дистрибуция 					Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",4", "4"); КонецЕсли;//4 დისტრიბუცია
	Если ВозвратПокупателяПокупателю 	Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",5", "5"); КонецЕсли;//5 უკან დაბრუნება
	Если ПодчиненнаяТН 					Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",6", "6"); КонецЕсли;//6 ქვე-ზედნადები
	
	П_Обработки = Новый Структура;
	П_Обработки.Вставить("Организация", 		Организация);
	П_Обработки.Вставить("ДатаНач", 			НачалоДня(ДатаНач));
	П_Обработки.Вставить("ДатаКон", 			КонецДня(ДатаКон));
	П_Обработки.Вставить("ИННКонтрагента",		ИННКонтрагента);
	П_Обработки.Вставить("itypes", 				itypes);
	
	
	Statuses = ",";
	Если СтатусТТНАктивный		Тогда statuses = ?(statuses = ",", statuses + "1", 	statuses + ",1");	КонецЕсли;//1 აქტიური
	Если СтатусТТНДоставленный	Тогда statuses = ?(statuses = ",", statuses + "2", 	statuses + ",2");	КонецЕсли;//2 დასრულებული
	
	//მიღებული
	Если Полученный И НЕ Statuses = "," Тогда
		П_Обработки.Вставить("Statuses", 			Statuses + ",");
	
		триДня 			= 86400 * 2;
		Если НачалоДня(ДатаКон) - НачалоДня(ДатаНач) <= триДня Тогда
			ТаблицаНакладных.Очистить();
			ТаблицаТоварыНакладных.Очистить();
			П_Обработки.Вставить("SoapAction", 		"get_buyer_waybills");
			
			ДанныеПриниятихНакладных    = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьПолученныеНакладные(П_Обработки, ТаблицаНакладных);//ქუდი
			Если НЕ ДанныеПриниятихНакладных = Неопределено Тогда
				П_Обработки.Вставить("SoapAction", 		"get_buyer_waybilll_goods_list");
				ДанныеТабПриниятихНакладных = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьПолученныеНакладные(П_Обработки, ТаблицаТоварыНакладных);//ცხრილი
				Если НЕ ДанныеТабПриниятихНакладных = Неопределено Тогда
					Объект.ТоварныеНакладныеНаПортале.Загрузить(ТаблицаНакладных);	
					Объект.ТоварыНаПортале.Загрузить(ТаблицаТоварыНакладных);
					Для Каждого нТоварыНаПортале ИЗ Объект.ТоварыНаПортале Цикл
						Если нТоварыНаПортале.VAT_TYPE = "0" Тогда
							нТоварыНаПортале.СуммаНДС = нТоварыНаПортале.AMOUNT - (нТоварыНаПортале.AMOUNT) /((100 + СтавкаНДС18)/100);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;				
			КонецЕсли;
		Иначе
			МассивДней = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьМассивДней(ДатаНач, ДатаКон);
			Для Каждого СтрокаДаты Из МассивДней Цикл
				ТаблицаНакладных.Очистить();
				ТаблицаТоварыНакладных.Очистить();
				П_Обработки.Вставить("ДатаНач", 		НачалоДня(СтрокаДаты.ДатаНач));
				П_Обработки.Вставить("ДатаКон", 		КонецДня(СтрокаДаты.ДатаКон));
				П_Обработки.Вставить("SoapAction", 		"get_buyer_waybills");
				
				ДанныеПриниятихНакладных    = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьПолученныеНакладные(П_Обработки, ТаблицаНакладных);//ქუდი
				Если НЕ ДанныеПриниятихНакладных = Неопределено Тогда
					П_Обработки.Вставить("SoapAction", 		"get_buyer_waybilll_goods_list");
					ДанныеТабПриниятихНакладных = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьПолученныеНакладные(П_Обработки, ТаблицаТоварыНакладных);//ცხრილი
					Если НЕ ДанныеТабПриниятихНакладных = Неопределено Тогда
						Для Каждого СтрокаНакладной Из ТаблицаНакладных Цикл
							нТоварныеНакладныеНаПортал = Объект.ТоварныеНакладныеНаПортале.Добавить();	
							ЗаполнитьЗначенияСвойств(нТоварныеНакладныеНаПортал, СтрокаНакладной);	
						КонецЦикла;
						
						Для Каждого СтокаТовара Из ТаблицаТоварыНакладных Цикл
							нТоварыНаПортале = Объект.ТоварыНаПортале.Добавить();	
							ЗаполнитьЗначенияСвойств(нТоварыНаПортале, СтокаТовара);
							Если СтокаТовара.VAT_TYPE = "0" Тогда
								нТоварыНаПортале.СуммаНДС = СтокаТовара.AMOUNT - (СтокаТовара.AMOUNT) /((100 + СтавкаНДС18)/100);
							КонецЕсли;
						КонецЦикла;						
					КонецЕсли;					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("Состояние", "მიღებული")).Количество() > 0 Тогда
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписокНакладных("მიღებული", Объект.ТоварныеНакладныеНаПортале);
		КонецЕсли;
	КонецЕсли;
	
	Statuses = ",";
	//Если СтатусТТНСохраненный	Тогда statuses = ?(statuses = ",", statuses + "0", 	statuses + ",0");	КонецЕсли;//0 შენახული
	Если СтатусТТНАктивный		Тогда statuses = ?(statuses = ",", statuses + "1", 	statuses + ",1");	КонецЕсли;//1 აქტიური
	Если СтатусТТНДоставленный	Тогда statuses = ?(statuses = ",", statuses + "2", 	statuses + ",2");	КонецЕсли;//2 დასრულებული
	Если СтатусТТНОтмененный	Тогда statuses = ?(statuses = ",", statuses + "-2", statuses + ",-2");	КонецЕсли;//-2 გაუქმებული
	
	itypes = "";
	//Если ВнутреннееПеремещение 		Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",1", "1"); КонецЕсли;//1 გადაადგილება
	Если РеализацияСТранспортировкой 	Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",2", "2"); КонецЕсли;//2 რეალიზაცია ტრანსპორტირებით
	Если РеализацияБезТранспортировки 	Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",3", "3"); КонецЕсли;//3 რეალიზაცია ტრანსპორტირების გარეშე
	Если Дистрибуция 					Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",4", "4"); КонецЕсли;//4 დისტრიბუცია
	Если ВозвратПокупателяПокупателю 	Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",5", "5"); КонецЕсли;//5 უკან დაბრუნება
	Если ПодчиненнаяТН 					Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",6", "6"); КонецЕсли;//6 ქვე-ზედნადები
	
	//გაცემული
	Если Отправленный И НЕ Statuses = "," Тогда
		ТаблицаНакладных.Очистить();
		ТаблицаТоварыНакладных.Очистить();
		П_Обработки.Вставить("ДатаНач", 					НачалоДня(ДатаНач));
		П_Обработки.Вставить("ДатаКон", 					КонецДня(ДатаКон));
		П_Обработки.Вставить("Statuses", 					Statuses + ",");
		П_Обработки.Вставить("itypes", 						itypes);
		П_Обработки.Вставить("SoapAction", 					"get_waybills");
		
		ДанныеРасходныхНакладных    = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВыданныеНакладные(П_Обработки, ТаблицаНакладных);//ქუდი
		Если НЕ ДанныеРасходныхНакладных = Неопределено Тогда
			П_Обработки.Вставить("SoapAction", 				"get_waybill_goods_list");
			ДанныеТоваровНакладных = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВыданныеНакладные(П_Обработки, ТаблицаТоварыНакладных);//ცხრილი
			Если НЕ ДанныеТоваровНакладных = Неопределено Тогда
				Для Каждого СтрокаНакладной Из ТаблицаНакладных Цикл
					нТоварныеНакладныеНаПортал = Объект.ТоварныеНакладныеНаПортале.Добавить();	
					ЗаполнитьЗначенияСвойств(нТоварныеНакладныеНаПортал,СтрокаНакладной);	
				КонецЦикла;
				
				Для Каждого СтокаТовара Из ТаблицаТоварыНакладных Цикл
					нТоварыНаПортале = Объект.ТоварыНаПортале.Добавить();	
					ЗаполнитьЗначенияСвойств(нТоварыНаПортале,СтокаТовара);
					Если СтокаТовара.VAT_TYPE = "0" Тогда
						нТоварыНаПортале.СуммаНДС = СтокаТовара.AMOUNT - (СтокаТовара.AMOUNT) /((100 + СтавкаНДС18)/100);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Если Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("Состояние", "გაგზავნილი")).Количество() > 0 Тогда
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписокНакладных("გაგზავნილი", Объект.ТоварныеНакладныеНаПортале);
		КонецЕсли;
	КонецЕсли;
	
	
	//შენახული
	Если СтатусТТНСохраненный Тогда
		ТаблицаНакладных.Очистить();
		ТаблицаТоварыНакладных.Очистить();
		П_Обработки.Вставить("ДатаНач", 					НачалоДня(ДатаНач));
		П_Обработки.Вставить("ДатаКон", 					КонецДня(ДатаКон));
		П_Обработки.Вставить("Statuses", 					",0,");
		П_Обработки.Вставить("СоответствиеНоменклатуры", 	Организация.СоответствиеПриВыгрузкеОтправленныхНоменклатур);
		П_Обработки.Вставить("SoapAction", 					"get_waybills");
		
		ДанныеРасходныхНакладных    = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВыданныеНакладные(П_Обработки, ТаблицаНакладных);//ქუდი
		Если НЕ ДанныеРасходныхНакладных = Неопределено Тогда
			П_Обработки.Вставить("SoapAction", 				"get_waybill_goods_list");
			ДанныеТоваровНакладных = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьВыданныеНакладные(П_Обработки, ТаблицаТоварыНакладных);//ცხრილი
			Если НЕ ДанныеТоваровНакладных = Неопределено Тогда
				Для Каждого СтрокаНакладной Из ТаблицаНакладных Цикл
					нТоварныеНакладныеНаПортал = Объект.ТоварныеНакладныеНаПортале.Добавить();	
					ЗаполнитьЗначенияСвойств(нТоварныеНакладныеНаПортал,СтрокаНакладной);	
				КонецЦикла;
				
				Для Каждого СтокаТовара Из ТаблицаТоварыНакладных Цикл
					нТоварыНаПортале = Объект.ТоварыНаПортале.Добавить();	
					ЗаполнитьЗначенияСвойств(нТоварыНаПортале,СтокаТовара);
					Если СтокаТовара.VAT_TYPE = "0" Тогда
						нТоварыНаПортале.СуммаНДС = СтокаТовара.AMOUNT - (СтокаТовара.AMOUNT) /((100 + СтавкаНДС18)/100);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Если Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("Состояние", "შენახული")).Количество() > 0 Тогда
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписокНакладных("შენახული", Объект.ТоварныеНакладныеНаПортале);
		КонецЕсли;
	КонецЕсли;
	
	//დოკუმენტებისთვის სტატუსების მინიჭება
	СтрокиСДокументами = Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("ДокументПревязан", Истина));
	Если СтрокиСДокументами.Количество() > 0 Тогда
		
		ТаблицаТоваров = Объект.ТоварыНаПортале.Выгрузить();
		ТаблицаТоваров.Свернуть("ID, WAYBILL_NUMBER", "AMOUNT, QUANTITY, СуммаНДС");
		
		Для Каждого СтрокаСДок ИЗ СтрокиСДокументами Цикл
			Если СтрокаСДок.Состояние = "მიღებული" Тогда 
				НайденныеСтрокиТоваров = ТаблицаТоваров.НайтиСтроки(Новый Структура("WAYBILL_NUMBER", СтрокаСДок.WAYBILL_NUMBER));
			Иначе //"შენახული" "გაგზავნილი"
				НайденныеСтрокиТоваров = ТаблицаТоваров.НайтиСтроки(Новый Структура("ID", СтрокаСДок.ID));
			КонецЕсли;
			Если НайденныеСтрокиТоваров.Количество() > 0 Тогда
				СтрокаТ = НайденныеСтрокиТоваров[0];
				Если СтрокаСДок.TYPE = 4 ИЛИ СтрокаСДок.TYPE = 1 Тогда
					Если СтрокаТ.QUANTITY = СтрокаСДок.КоличествоДокумента Тогда
						СтрокаСДок.СтатусСинхронизации = "სრულად სინქრონიზირებული";
					Иначе
						СтрокаСДок.СтатусСинхронизации = "ნაწილობრივ სინქრონიზირებული";
						СтрокаСДок.РасшифровкаСтатуса = СтрокаСДок.РасшифровкаСтатуса + "განსხვავდება რაოდენობა. RS: " + СтрокаТ.QUANTITY + ", დოკუმენტი: " + СтрокаСДок.КоличествоДокумента + ";";
					КонецЕсли;
				Иначе
					Если СтрокаТ.СуммаНДС = СтрокаСДок.СуммаНДСДокумента И СтрокаТ.AMOUNT = СтрокаСДок.СуммаДокумента И СтрокаТ.QUANTITY = СтрокаСДок.КоличествоДокумента Тогда
						Если СтрокаСДок.ЕстьУслугиВДокументе И НЕ СтрокаСДок.ЕстьТоварыВДокументе Тогда
							СтрокаСДок.СтатусСинхронизации = "ჩამოწერილი მომსახურებაში";
						ИначеЕсли СтрокаСДок.ЕстьУслугиВДокументе Тогда
							СтрокаСДок.СтатусСинхронизации = "ნაწილობრივ ჩამოწერილი მომსახურებაში";
						Иначе
							СтрокаСДок.СтатусСинхронизации = "სრულად სინქრონიზირებული";
						КонецЕсли;
					Иначе
						СтрокаСДок.СтатусСинхронизации = "ნაწილობრივ სინქრონიზირებული";
						Если НЕ СтрокаТ.AMOUNT = СтрокаСДок.СуммаДокумента Тогда
							СтрокаСДок.РасшифровкаСтатуса = "განსხვავდება თანხა. RS: " + СтрокаТ.AMOUNT + ", დოკუმენტი: " + СтрокаСДок.СуммаДокумента + "; ";
						КонецЕсли;
						Если НЕ СтрокаТ.СуммаНДС = СтрокаСДок.СуммаНДСДокумента Тогда
							СтрокаСДок.РасшифровкаСтатуса = СтрокаСДок.РасшифровкаСтатуса + "განსხვავდება დღგ-ს თანხა. RS: " + СтрокаТ.СуммаНДС + ", დოკუმენტი: " + СтрокаСДок.СуммаНДСДокумента + "; ";
						КонецЕсли;
						Если НЕ СтрокаТ.QUANTITY = СтрокаСДок.КоличествоДокумента Тогда
							СтрокаСДок.РасшифровкаСтатуса = СтрокаСДок.РасшифровкаСтатуса + "განსხვავდება რაოდენობა. RS: " + СтрокаТ.QUANTITY + ", დოკუმენტი: " + СтрокаСДок.КоличествоДокумента + "; ";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	СтрокиСПустымиДокументами =  Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("ДокументПревязан", Ложь));
	Для Каждого СтрокаПуст ИЗ СтрокиСПустымиДокументами Цикл
		СтрокаПуст.СтатусСинхронизации = "არსებობს მხოლოდ პორტალზე";
	КонецЦикла;
	
	ЗаполнитьНоменклатуруОтправленные_НаСервере();
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписок_Контрагентов(Объект.ТоварныеНакладныеНаПортале);	
	ДанныеНеСоответствуютФильтру = Ложь;
	
	ОбновитьЦеныНоменклатуры();
	
КонецПроцедуры



&НаСервере
Процедура ОбновитьЦеныНоменклатуры(Идентификатор = Неопределено)
	
	
	Если
		 Не ЗначениеЗаполнено(Контрагент) Или
		 Не ЗначениеЗаполнено(ВидЦен) Тогда
		Возврат;
	КонецЕсли;
	
	Если Идентификатор = Неопределено Тогда
		Для Каждого СтрокаТЧ Из Объект.ТоварыНаПортале Цикл 
			Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда 
				Цены = РегистрыСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, Новый Структура("Номенклатура, Характеристика",  СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика));//Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()
				Если Не Цены.Количество() = 0 Тогда
					СтрокаТЧ.Цена = Цены[0].Цена;
				Иначе
					СтрокаТЧ.Цена = 0;
				КонецЕсли;
			Иначе
				СтрокаТЧ.Цена = 0;
			КонецЕсли;
			
			Если СтрокаТЧ.PRICE = СтрокаТЧ.Цена Тогда
				СтрокаТЧ.ЦветСравнения = 0;
			ИначеЕсли СтрокаТЧ.PRICE < СтрокаТЧ.Цена Тогда
				СтрокаТЧ.ЦветСравнения = 1;
			Иначе
				СтрокаТЧ.ЦветСравнения = -1;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СтрокаТЧ = Объект.ТоварыНаПортале.НайтиПоИдентификатору(Идентификатор);
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда 
			Цены = РегистрыСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, Новый Структура("Номенклатура, Характеристика",  СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика));//Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()
			Если Не Цены.Количество() = 0 Тогда
				СтрокаТЧ.Цена = Цены[0].Цена;
			Иначе
				СтрокаТЧ.Цена = 0;
			КонецЕсли;
		Иначе
			СтрокаТЧ.Цена = 0;
		КонецЕсли;
		
		Если СтрокаТЧ.PRICE = СтрокаТЧ.Цена Тогда
			СтрокаТЧ.ЦветСравнения = 0;
		ИначеЕсли СтрокаТЧ.PRICE < СтрокаТЧ.Цена Тогда
			СтрокаТЧ.ЦветСравнения = 1;
		Иначе
			СтрокаТЧ.ЦветСравнения = -1;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЦеныПродаж(Идентификатор = Неопределено)
	
	ВидЦенПродажи = Справочники.ВидыЦен.Оптовая;
	
	Если Идентификатор = Неопределено Тогда
		Для Каждого СтрокаТЧ Из Объект.ТоварыНаПортале Цикл 
			Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
				ЦеныПродажи = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(, Новый Структура("ВидЦен, Номенклатура, Характеристика", ВидЦенПродажи, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика));
				Если Не ЦеныПродажи.Количество() = 0 Тогда
					СтрокаТЧ.ЦенаНоменклатуры = ЦеныПродажи[0].Цена;
				Иначе
					СтрокаТЧ.ЦенаНоменклатуры = 0;
				КонецЕсли;
			Иначе
				СтрокаТЧ.ЦенаНоменклатуры = 0;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СтрокаТЧ = Объект.ТоварыНаПортале.НайтиПоИдентификатору(Идентификатор);
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			ЦеныПродажи = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(, Новый Структура("ВидЦен, Номенклатура, Характеристика", ВидЦенПродажи, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика));
			Если Не ЦеныПродажи.Количество() = 0 Тогда
				СтрокаТЧ.ЦенаНоменклатуры = ЦеныПродажи[0].Цена;
			Иначе
				СтрокаТЧ.ЦенаНоменклатуры = 0;
			КонецЕсли;
		Иначе
			СтрокаТЧ.ЦенаНоменклатуры = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура СоздатьНакладные(Команда)
	
	ОчиститьСообщения();
	Если ДанныеНеСоответствуютФильтру Тогда 
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	СоздатьДокументы_НаСервере(ЕстьОшибки);
	Если НЕ ЕстьОшибки Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаСозданныеДокументы;
		ЗаполнитьНоменклатуруПолученные_НаСервере();
		ЗаполнитьНоменклатуруОтправленные_НаСервере();
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура СоздатьДокументы_НаСервере(ЕстьОшибки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Представление КАК Адрес,
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка КАК Склад,
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.ТранспортноеСредство
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
		|ГДЕ
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы)
		|	И СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)";
	ТаблицаСкладов = Запрос.Выполнить().Выгрузить();
	
	ПроверитьПередСозданиемДокументов(ЕстьОшибки);
	
	//ТаблицаКонтрагентов = Новый ТаблицаЗначений;
	//ТаблицаКонтрагентов.Колонки.Добавить("Контрагент",	Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	//ТаблицаКонтрагентов.Колонки.Добавить("ИНН", 			Новый ОписаниеТипов("Строка", , , ,Новый КвалификаторыСтроки(13)));
	//ТаблицаКонтрагентов.Колонки.Добавить("Поставщик", 	Новый ОписаниеТипов("Булево"));
	//ТаблицаКонтрагентов.Колонки.Добавить("Покупатель", 	Новый ОписаниеТипов("Булево"));
	
	СчетаУчета = РегламентированныйУчетСервер.ПолучитьСчетаКонтрагентаПоУмолчанию();
	
	СоздатьДокументы_Полученные_НаСервере(ТаблицаСкладов, 	ЕстьОшибки, СчетаУчета);
	СоздатьДокументы_Отправленные_НаСервере(ТаблицаСкладов, ЕстьОшибки, СчетаУчета);
	
КонецПроцедуры
&НаСервере
Процедура СоздатьДокументы_Полученные_НаСервере(ТаблицаСкладов, 	ЕстьОшибки, СчетаУчета)
	
	ОтмеченныеСтроки = Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("Флаг, ЕстьОшибки, Полученный", Истина, Ложь, Истина));
	Для Каждого СтрокаТТН Из ОтмеченныеСтроки Цикл
		//Создать документ
		Если СтрокаТТН.TYPE = 1 Тогда
			Если СтрокаТТН.ЭтаИмущество Тогда
				ДокОбъект = Документы.ПеремещениеВА.СоздатьДокумент();
			Иначе
			    ДокОбъект = Документы.ПеремещениеЗапасов.СоздатьДокумент();
				ДокОбъект.ВидОперации	= Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
			КонецЕсли;
		ИначеЕсли СтрокаТТН.TYPE = 5 Тогда
			ДокОбъект = Документы.РасходнаяНакладная.СоздатьДокумент();
			ДокОбъект.ВидОперации				= Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику;
			Если ЗначениеЗаполнено(СтрокаТТН.Контрагент) Тогда
				ДокОбъект.Контрагент				= СтрокаТТН.Контрагент;
			Иначе
				Если СоздатьНовыйКонтрагентЕслиНеНайден Тогда
					НайденныйКонтрагенты = ТаблицаКонтрагентов.НайтиСтроки(Новый Структура("ИНН", СтрокаТТН.SELLER_TIN));
					Если НайденныйКонтрагенты.Количество() = 0 Тогда
						КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
						КонтрагентОбъект.Наименование	= СтрокаТТН.SELLER_NAME;
						КонтрагентОбъект.ИНН			= СтрокаТТН.SELLER_TIN;
						КонтрагентОбъект.Поставщик		= Истина;
						Если СтрДлина(СтрокаТТН.SELLER_TIN) = 9 Тогда
							КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
						Иначе
							КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(КонтрагентОбъект, СчетаУчета);
						КонтрагентОбъект.Заполнить(Неопределено);
						КонтрагентОбъект.Записать();
						ДокОбъект.Контрагент				= КонтрагентОбъект.Ссылка;
					Иначе
						ДокОбъект.Контрагент				= НайденныйКонтрагенты[0].Контрагент;
					КонецЕсли;
					СтрокаТТН.Контрагент = ДокОбъект.Контрагент;
				КонецЕсли;
			КонецЕсли;
			ДокОбъект.Договор 	 				= ДокОбъект.Контрагент.ДоговорПоУмолчанию;
			ДокОбъект.ВалютаДокумента	 		= НациональнаяВалюта;
		Иначе
			ДокОбъект = Документы.ПриходнаяНакладная.СоздатьДокумент();
			ДокОбъект.ВидОперации				= Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
			Если ЗначениеЗаполнено(СтрокаТТН.Контрагент) Тогда
				ДокОбъект.Контрагент				= СтрокаТТН.Контрагент;
			Иначе
				Если СоздатьНовыйКонтрагентЕслиНеНайден Тогда
					НайденныйКонтрагенты = ТаблицаКонтрагентов.НайтиСтроки(Новый Структура("ИНН", СтрокаТТН.SELLER_TIN));
					Если НайденныйКонтрагенты.Количество() = 0 Тогда
						КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
						КонтрагентОбъект.Наименование	= СтрокаТТН.SELLER_NAME;
						КонтрагентОбъект.ИНН			= СтрокаТТН.SELLER_TIN;
						КонтрагентОбъект.Поставщик		= Истина;
						Если СтрДлина(СтрокаТТН.SELLER_TIN) = 9 Тогда
							КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
						Иначе
							КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(КонтрагентОбъект, СчетаУчета);
						КонтрагентОбъект.Заполнить(Неопределено);
						КонтрагентОбъект.Записать();
						ДокОбъект.Контрагент				= КонтрагентОбъект.Ссылка;
					Иначе
						ДокОбъект.Контрагент				= НайденныйКонтрагенты[0].Контрагент;
					КонецЕсли;
					СтрокаТТН.Контрагент = ДокОбъект.Контрагент;
				КонецЕсли;
			КонецЕсли;
			ДокОбъект.Договор 	 				= ДокОбъект.Контрагент.ДоговорПоУмолчанию;
			ДокОбъект.ВалютаДокумента	 		= НациональнаяВалюта;
			//Если УчетЦенКонтрагентов Тогда
			ДокОбъект.ВидЦенКонтрагента 	    	= ДокОбъект.Договор.ВидЦенКонтрагента;
			//	ДокОбъект.РегистрироватьЦеныПоставщика	= Истина;
			//КонецЕсли;
		КонецЕсли;
		
		//Шапка
		ДокОбъект.Дата 						= СтрокаТТН.BEGIN_DATE;
		ДокОбъект.Организация 				= Организация;
		ДокОбъект.Заполнить(Неопределено);
		Если СтрокаТТН.TYPE = 1 Тогда
			Если НЕ СтрокаТТН.ЭтаИмущество Тогда
			Если ЗначениеЗаполнено(СтрокаТТН.START_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.START_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТТН.END_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.END_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиницаПолучатель	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиницаПолучатель	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиницаПолучатель	= Неопределено;
			КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрокаТТН.TYPE = 5 Тогда
			Если ЗначениеЗаполнено(СтрокаТТН.START_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.START_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(СтрокаТТН.END_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.END_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
		КонецЕсли;
		ДокОбъект.УстановитьНовыйНомер();
		ДокОбъект.НомерТТН	 				= СтрокаТТН.WAYBILL_NUMBER;
		ДокОбъект.IDTТН						= СтрокаТТН.ID;
		//ДокОбъект.СтатусТТН   			  = СтрокаТТН.СтатусТН;
		//ДокОбъект.ДатаНачалаТранспортировки = СтрокаТТН.BEGIN_DATE;

		//Запасы-Услуги
		//СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("WAYBILL_NUMBER", СтрокаТТН.WAYBILL_NUMBER));
		Если СтрокаТТН.WAYBILL_NUMBER = "" Тогда
			СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("ID", 				СтрокаТТН.ID));
		Иначе
			СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("WAYBILL_NUMBER",	СтрокаТТН.WAYBILL_NUMBER));
		КонецЕсли;
		
		ЕстьУслуга	= Ложь;
		ЕстьТовар	= Ложь;
		Если СтрокаТТН.TYPE = 1 Тогда
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				Если СтрокаТТН.ЭтаИмущество Тогда
					НоваяСтрокаТЧ = ДокОбъект.ВнеоборотныеАктивы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
					НоваяСтрокаТЧ.Адрес                       = СтрокаТТН.START_ADDRESS;
					НоваяСтрокаТЧ.АдресПолучатель             = СтрокаТТН.END_ADDRESS;
					ДанныеВА = РегистрыСведений.ПараметрыВнеоборотныхАктивов.ПолучитьПоследнее( , Новый Структура("ВнеоборотныйАктив", СтрокаТовары.ВнеоборотныйАктив));
					РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиков(СтрокаТовары);
					НоваяСтрокаТЧ.СтруктурнаяЕдиница           = ДанныеВА.СтруктурнаяЕдиница;
					НоваяСтрокаТЧ.СтруктурнаяЕдиницаПолучатель = ДанныеВА.СтруктурнаяЕдиница;
				Иначе
					НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
					НоваяСтрокаТЧ.СтранаПроисхождения 	= НоваяСтрокаТЧ.Номенклатура.СтранаПроисхождения;
					НоваяСтрокаТЧ.НомерГТД			  	= Неопределено;
					НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
					РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиков(СтрокаТовары);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли СтрокаТТН.TYPE = 5 Тогда
			СтавкаНДСПоУмолчанию = Неопределено;
			Если      ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
			ИначеЕсли ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
			КонецЕсли;
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
				НоваяСтрокаТЧ.СтранаПроисхождения 	= НоваяСтрокаТЧ.Номенклатура.СтранаПроисхождения;
				НоваяСтрокаТЧ.НомерГТД			  	= Неопределено;
				НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
				НоваяСтрокаТЧ.Цена				  	= ?(СтрокаТовары.QUANTITY = 0, 0, СтрокаТовары.AMOUNT/СтрокаТовары.QUANTITY);
				НоваяСтрокаТЧ.Сумма				 	= СтрокаТовары.AMOUNT;
				Если ЗначениеЗаполнено(СтавкаНДСПоУмолчанию) Тогда
					НоваяСтрокаТЧ.СтавкаНДС 	= СтавкаНДСПоУмолчанию;
				Иначе
					Если СтрокаТовары.VAT_TYPE = "1" Тогда 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0");
					ИначеЕсли СтрокаТовары.VAT_TYPE = "2" Тогда 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("БезНДС");
					Иначе 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
					КонецЕсли;
				КонецЕсли;
				РассчитатьСуммуВСтрокеТабличнойЧасти(ДокОбъект,НоваяСтрокаТЧ);
				
				РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиков(СтрокаТовары);
			КонецЦикла;
		Иначе
			СтавкаНДСПоУмолчанию = Неопределено;
			Если      ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
			ИначеЕсли ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
			КонецЕсли;
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				Если СтрокаТовары.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
					НоваяСтрокаТЧ = ДокОбъект.Расходы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
										
					Если Не ЗначениеЗаполнено(ОсновноеПодразделение) Тогда
						ОсновноеПодразделение = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
					КонецЕсли;
					НоваяСтрокаТЧ.СтруктурнаяЕдиница = ОсновноеПодразделение;
					ЕстьУслуга	= Истина;
				Иначе
					НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
					НоваяСтрокаТЧ.СтранаПроисхождения 				= СтрокаТовары.Номенклатура.СтранаПроисхождения;
					НоваяСтрокаТЧ.НеобходимостьВводаАкцизнойМарки	= НоваяСтрокаТЧ.Номенклатура.ВидАлкогольнойПродукции.Маркируемый;
					НоваяСтрокаТЧ.НомерГТД			  				= Неопределено;
					ЕстьТовар	= Истина;
				КонецЕсли;
				НоваяСтрокаТЧ.Содержание			= СтрокаТовары.W_NAME;
				НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
				НоваяСтрокаТЧ.Цена				  	= ?(СтрокаТовары.QUANTITY = 0, 0, СтрокаТовары.AMOUNT/СтрокаТовары.QUANTITY);
				НоваяСтрокаТЧ.Сумма				 	= СтрокаТовары.AMOUNT;
				Если ЗначениеЗаполнено(СтавкаНДСПоУмолчанию) Тогда
					НоваяСтрокаТЧ.СтавкаНДС 	= СтавкаНДСПоУмолчанию;
				Иначе
					Если СтрокаТовары.VAT_TYPE = "1" Тогда 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0");
					ИначеЕсли СтрокаТовары.VAT_TYPE = "2" Тогда 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("БезНДС");
					Иначе 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
					КонецЕсли;
				КонецЕсли;
				РассчитатьСуммуВСтрокеТабличнойЧасти(ДокОбъект,НоваяСтрокаТЧ);
				
				Если СтрокаТовары.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
					РС_ОбщегоНазначения.ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная("Сумма", НоваяСтрокаТЧ, ДокОбъект.СуммаВключаетНДС);
				КонецЕсли;
				
				РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиков(СтрокаТовары);
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			Если СтрокаТТН.TYPE = 1 И НЕ СтрокаТТН.ЭтаИмущество И (НЕ ЗначениеЗаполнено(ДокОбъект.СтруктурнаяЕдиница) ИЛИ НЕ ЗначениеЗаполнено(ДокОбъект.СтруктурнаяЕдиницаПолучатель)) Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
				впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
				впНоваяСтрокаДок.Проведен	= Ложь;
			Иначе
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
					впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
					впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
					впНоваяСтрокаДок.Проведен	= Истина;
				Исключение
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
					впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
					впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
					впНоваяСтрокаДок.Проведен	= Ложь;
				КонецПопытки;
			КонецЕсли;
			СтрокаТТН.Документ			= ДокОбъект.Ссылка;
			СтрокаТТН.Флаг				= Ложь;
			СтрокаТТН.ДокументПревязан 	= Истина;
			Если ЕстьУслуга И ЕстьТовар Тогда
				СтрокаТТН.СтатусСинхронизации	= "ნაწილობრივ ჩამოწერილი მომსახურებაში";
			ИначеЕсли ЕстьУслуга И НЕ ЕстьТовар Тогда
				СтрокаТТН.СтатусСинхронизации	= "ჩამოწერილი მომსახურებაში";
			Иначе
				СтрокаТТН.СтатусСинхронизации	= "სრულად სინქრონიზირებული";
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
Процедура СоздатьДокументы_Отправленные_НаСервере(ТаблицаСкладов,	ЕстьОшибки, СчетаУчета)
	
	ОтмеченныеСтроки = Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("Флаг, ЕстьОшибки, Полученный", Истина, Ложь, Ложь));
	Для Каждого СтрокаТТН Из ОтмеченныеСтроки Цикл
		//Создать документ
		Если СтрокаТТН.TYPE = 4 ИЛИ СтрокаТТН.TYPE = 1 Тогда
			ДокОбъект = Документы.ПеремещениеЗапасов.СоздатьДокумент();
			ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
		ИначеЕсли СтрокаТТН.TYPE = 5 Тогда
			ДокОбъект = Документы.ПриходнаяНакладная.СоздатьДокумент();
			ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
			Если ЗначениеЗаполнено(СтрокаТТН.Контрагент) Тогда
				ДокОбъект.Контрагент				= СтрокаТТН.Контрагент;
			Иначе
				Если СоздатьНовыйКонтрагентЕслиНеНайден Тогда
					НайденныйКонтрагенты = ТаблицаКонтрагентов.НайтиСтроки(Новый Структура("ИНН", СтрокаТТН.BUYER_TIN));
					Если НайденныйКонтрагенты.Количество() = 0 Тогда
						КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
						КонтрагентОбъект.Наименование	= СтрокаТТН.BUYER_NAME;
						КонтрагентОбъект.ИНН			= СтрокаТТН.BUYER_TIN;
						КонтрагентОбъект.Покупатель		= Истина;
						Если СтрДлина(СтрокаТТН.SELLER_TIN) = 9 Тогда
							КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
						Иначе
							КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(КонтрагентОбъект, СчетаУчета);
						КонтрагентОбъект.Заполнить(Неопределено);
						КонтрагентОбъект.Записать();
						ДокОбъект.Контрагент				= КонтрагентОбъект.Ссылка;
					Иначе
						ДокОбъект.Контрагент				= НайденныйКонтрагенты[0].Контрагент;
					КонецЕсли;
					СтрокаТТН.Контрагент = ДокОбъект.Контрагент;
				КонецЕсли;
			КонецЕсли;
			ДокОбъект.Договор 	 				= ДокОбъект.Контрагент.ДоговорПоУмолчанию;
			ДокОбъект.ВалютаДокумента	 		= НациональнаяВалюта;
		Иначе
			ДокОбъект = Документы.РасходнаяНакладная.СоздатьДокумент();
			ДокОбъект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
			Если ЗначениеЗаполнено(СтрокаТТН.Контрагент) Тогда
				ДокОбъект.Контрагент				= СтрокаТТН.Контрагент;
			Иначе
				Если СоздатьНовыйКонтрагентЕслиНеНайден Тогда
					НайденныйКонтрагенты = ТаблицаКонтрагентов.НайтиСтроки(Новый Структура("ИНН", СтрокаТТН.BUYER_TIN));
					Если НайденныйКонтрагенты.Количество() = 0 Тогда
						КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
						КонтрагентОбъект.Наименование	= СтрокаТТН.BUYER_NAME;
						КонтрагентОбъект.ИНН			= СтрокаТТН.BUYER_TIN;
						КонтрагентОбъект.Покупатель		= Истина;
						Если СтрДлина(СтрокаТТН.SELLER_TIN) = 9 Тогда
							КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
						Иначе
							КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(КонтрагентОбъект, СчетаУчета);
						КонтрагентОбъект.Заполнить(Неопределено);
						КонтрагентОбъект.Записать();
						ДокОбъект.Контрагент				= КонтрагентОбъект.Ссылка;
					Иначе
						ДокОбъект.Контрагент				= НайденныйКонтрагенты[0].Контрагент;
					КонецЕсли;
					СтрокаТТН.Контрагент = ДокОбъект.Контрагент;
				КонецЕсли;
			КонецЕсли;
			ДокОбъект.Договор 	 				= ДокОбъект.Контрагент.ДоговорПоУмолчанию;
			ДокОбъект.ВалютаДокумента	 		= НациональнаяВалюта;
		КонецЕсли;
		
		//Шапка
		ДокОбъект.Дата 						= ?(ЗначениеЗаполнено(СтрокаТТН.BEGIN_DATE), СтрокаТТН.BEGIN_DATE, СтрокаТТН.ACTIVATE_DATE);
		ДокОбъект.Организация 				= Организация;
		ДокОбъект.Заполнить(Неопределено);
		Если СтрокаТТН.TYPE = 4 Тогда //Дистрибюция
			Если ЗначениеЗаполнено(СтрокаТТН.START_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.START_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТТН.CAR_NUMBER) Тогда
				
				ТранспортноеСредство = Справочники.ТранспортныеСредства.НайтиПоКоду(СтрокаТТН.CAR_NUMBER);
				
				СтрокаСклада =  ТаблицаСкладов.Найти(ТранспортноеСредство, "ТранспортноеСредство");
				
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиницаПолучатель	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиницаПолучатель	= Неопределено;
				КонецЕсли;
				
			Иначе
				ДокОбъект.СтруктурнаяЕдиницаПолучатель	= Неопределено;
			КонецЕсли;
		ИначеЕсли СтрокаТТН.TYPE = 5 Тогда  //Возврат от покупателя
			Если ЗначениеЗаполнено(СтрокаТТН.START_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.END_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
		Иначе //Реализация
			Если ЗначениеЗаполнено(СтрокаТТН.END_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.START_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
		КонецЕсли;
		ДокОбъект.УстановитьНовыйНомер();
		ДокОбъект.НомерТТН	 				= СтрокаТТН.WAYBILL_NUMBER;
		ДокОбъект.IDTТН						= СтрокаТТН.ID;
		//ДокОбъект.СтатусТТН   			  = СтрокаТТН.СтатусТН;
		//ДокОбъект.ДатаНачалаТранспортировки = СтрокаТТН.BEGIN_DATE;

		//Запасы-Услуги
		//СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("WAYBILL_NUMBER", СтрокаТТН.WAYBILL_NUMBER));
		Если СтрокаТТН.WAYBILL_NUMBER = "" Тогда
			СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("ID", 				СтрокаТТН.ID));
		Иначе
			СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("WAYBILL_NUMBER",	СтрокаТТН.WAYBILL_NUMBER));
		КонецЕсли;
		Если СтрокаТТН.TYPE = 4 ИЛИ СтрокаТТН.TYPE = 1 Тогда
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
				НоваяСтрокаТЧ.СтранаПроисхождения 	= НоваяСтрокаТЧ.Номенклатура.СтранаПроисхождения;
				НоваяСтрокаТЧ.НомерГТД			  	= Неопределено;
				НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
				
				//РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиков(СтрокаТовары);
			КонецЦикла;
		ИначеЕсли СтрокаТТН.TYPE = 5 Тогда
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
				НоваяСтрокаТЧ.СтранаПроисхождения 	= НоваяСтрокаТЧ.Номенклатура.СтранаПроисхождения;
				НоваяСтрокаТЧ.НеобходимостьВводаАкцизнойМарки	= НоваяСтрокаТЧ.Номенклатура.ВидАлкогольнойПродукции.Маркируемый;
				НоваяСтрокаТЧ.НомерГТД			  	= Неопределено;
				НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
				НоваяСтрокаТЧ.Цена				  	= ?(СтрокаТовары.QUANTITY = 0, 0, СтрокаТовары.AMOUNT/СтрокаТовары.QUANTITY);
				НоваяСтрокаТЧ.Сумма				 	= СтрокаТовары.AMOUNT;
				Если СтрокаТовары.VAT_TYPE = "1" Тогда 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0");
				ИначеЕсли СтрокаТовары.VAT_TYPE = "2" Тогда 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("БезНДС");
				Иначе 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
				КонецЕсли;
				РассчитатьСуммуВСтрокеТабличнойЧасти(ДокОбъект,НоваяСтрокаТЧ);
				
				//РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиков(СтрокаТовары);
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				//Если СтрокаТовары.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				//	НоваяСтрокаТЧ = ДокОбъект.Расходы.Добавить();
				//	ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
				//	Если Не ЗначениеЗаполнено(ОсновноеПодразделение) Тогда
				//		ОсновноеПодразделение = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
				//	КонецЕсли;
				//	НоваяСтрокаТЧ.СтруктурнаяЕдиница = ОсновноеПодразделение;
				//Иначе
					НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
					НоваяСтрокаТЧ.СтранаПроисхождения 				= СтрокаТовары.Номенклатура.СтранаПроисхождения;
					НоваяСтрокаТЧ.НомерГТД			  				= Неопределено;
				//КонецЕсли;
				НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
				НоваяСтрокаТЧ.Цена				  	= ?(СтрокаТовары.QUANTITY = 0, 0, СтрокаТовары.AMOUNT/СтрокаТовары.QUANTITY);
				НоваяСтрокаТЧ.Сумма				 	= СтрокаТовары.AMOUNT;
				Если СтрокаТовары.VAT_TYPE = "1" Тогда 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0");
				ИначеЕсли СтрокаТовары.VAT_TYPE = "2" Тогда 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("БезНДС");
				Иначе 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
				КонецЕсли;
				РассчитатьСуммуВСтрокеТабличнойЧасти(ДокОбъект,НоваяСтрокаТЧ);
				
				//РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиков(СтрокаТовары);
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			Если (СтрокаТТН.TYPE = 1 ИЛИ СтрокаТТН.TYPE = 4) И (НЕ ЗначениеЗаполнено(ДокОбъект.СтруктурнаяЕдиница) ИЛИ НЕ ЗначениеЗаполнено(ДокОбъект.СтруктурнаяЕдиницаПолучатель)) Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
				впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
				впНоваяСтрокаДок.Проведен	= Ложь;
			Иначе
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
					впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
					впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
					впНоваяСтрокаДок.Проведен	= Истина;
				Исключение
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
					впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
					впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
					впНоваяСтрокаДок.Проведен	= Ложь;
				КонецПопытки;
			КонецЕсли;
			СтрокаТТН.Документ			= ДокОбъект.Ссылка;
			СтрокаТТН.Флаг				= Ложь;
			СтрокаТТН.ДокументПревязан	= Истина;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(ДокОбъект, СтрокаТабличнойЧасти = Неопределено)
	
	//СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	РассчитатьСуммуНДС(ДокОбъект,СтрокаТабличнойЧасти);
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ДокОбъект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()
&НаСервере
Процедура РассчитатьСуммуНДС(ДокОбъект,СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС = ?(ДокОбъект.СуммаВключаетНДС, 
									  СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
									  СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
	
КонецПроцедуры // РассчитатьСуммуНДС()


&НаКлиенте
Процедура ТоварныеНакладныеНаПорталеПриАктивизацииСтроки(Элемент)
	впТекущаяСтрока = Элементы.ТоварныеНакладныеНаПортале.ТекущиеДанные;
	
	Если впТекущаяСтрока <> Неопределено Тогда
		Если впТекущаяСтрока.WAYBILL_NUMBER = "" Тогда
			Элементы.ТоварыНаПортале.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", впТекущаяСтрока.ID);
		Иначе
			Элементы.ТоварыНаПортале.ОтборСтрок = Новый ФиксированнаяСтруктура("WAYBILL_NUMBER", впТекущаяСтрока.WAYBILL_NUMBER);
		КонецЕсли;
		ЭтаЭтаИмущество = впТекущаяСтрока.ЭтаИмущество;
		Элементы.ТоварыНаПорталеВнеоборотныйАктив.Видимость = ЭтаЭтаИмущество;
		Элементы.ТоварыНаПорталеНоменклатура.Видимость 		= НЕ ЭтаЭтаИмущество;
		Элементы.ТоварыНаПорталеХарактеристика.Видимость 	= НЕ ЭтаЭтаИмущество;
		Элементы.ТоварыНаПорталеЕдиницаИзмерения.Видимость 	= НЕ ЭтаЭтаИмущество;
	Иначе 
		Элементы.ТоварыНаПортале.ОтборСтрок = Новый ФиксированнаяСтруктура("WAYBILL_NUMBER", "????");
		Элементы.ТоварыНаПорталеВнеоборотныйАктив.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьУпаковкуПоИмениЕдиницы(ИмяЕдиницы, ВладелецНоменклатура, ИзРегистра)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕдиницыИзмерения.Ссылка КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.КодДляНалоговой = &ИмяЕдиницы");
	
	
	Запрос.УстановитьПараметр("ИмяЕдиницы", ИмяЕдиницы);
	Запрос.УстановитьПараметр("Владелец", ВладелецНоменклатура);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		//впУпаковка = Выборка.Упаковка;
		
		СтруктураЕдиниц = Новый Структура;
		СтруктураЕдиниц.Вставить("ЕдиницаИзмерения", ?(ЗначениеЗаполнено(Выборка.ЕдиницаИзмерения), Выборка.ЕдиницаИзмерения, Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка()));
		
		//Возврат ?(ЗначениеЗаполнено(впУпаковка), впУпаковка, Неопределено);
		Возврат СтруктураЕдиниц;
		
	КонецЕсли;
	СтруктураЕдиниц = Новый Структура;
	СтруктураЕдиниц.Вставить("ЕдиницаИзмерения", ВладелецНоменклатура.ЕдиницаИзмерения);
	Возврат СтруктураЕдиниц;
	
КонецФункции




&НаКлиенте
Процедура ЗаполнитьНоменклатуру(Команда)
	ЗаполнитьНоменклатуруПолученные_НаСервере();
	ЗаполнитьНоменклатуруОтправленные_НаСервере();
	ОбновитьЦеныНоменклатуры();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьНоменклатуруПолученные_НаСервере()
	СтрокиПриходов = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("Полученный", Истина));
	Для Каждого СтрокаТЧ Из СтрокиПриходов Цикл
		РегистрыСведений.ТоварыПоставщиковВТТН.ЗаполнитьДанныеПоНоменклатуреПоставщика(СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьНоменклатуруОтправленные_НаСервере()
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьНоменклатуру_Отправленные(ИмяСоответствияНоменклатуры, Объект.ТоварыНаПортале);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоответствиеНоменклатуры()
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ИмяСоответствияНоменклатуры = "Код";
	Иначе
		СоответствиеОтправленныхНоменклатур = Организация.СоответствиеПриВыгрузкеОтправленныхНоменклатур;
		Если	  СоответствиеОтправленныхНоменклатур = 0 Тогда
			ИмяСоответствияНоменклатуры = "Код";
		ИначеЕсли СоответствиеОтправленныхНоменклатур = 1 Тогда
			ИмяСоответствияНоменклатуры = "Артикул";
		ИначеЕсли СоответствиеОтправленныхНоменклатур = 2 Тогда
			ИмяСоответствияНоменклатуры = "ОсновнойШтрихКод";
		Иначе
			ИмяСоответствияНоменклатуры = "Наименование";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ТоварыНаПорталеНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.ТоварыНаПортале.ТекущиеДанные;
	ТекДанные.ЕдиницаИзмерения = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекДанные.Номенклатура, "ЕдиницаИзмерения");
	ОбновитьЦеныНоменклатуры(Элементы.ТоварыНаПортале.ТекущаяСтрока);
	ОбновитьЦеныПродаж(Элементы.ТоварыНаПортале.ТекущаяСтрока);
КонецПроцедуры



&НаСервере
Процедура ПроверитьПередСозданиемДокументов(ЕстьОшибки)
	
	НЕ_СоздатьНовыйКонтрагентЕслиНеНайден = НЕ СоздатьНовыйКонтрагентЕслиНеНайден;
	ОтмеченныеСтроки = Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("Флаг", Истина));
	Для Каждого СтрокаТТН Из ОтмеченныеСтроки Цикл
		СтрокаТТН.ЕстьОшибки = Ложь;//ეს საჭიროა შემოწმებამდე
		Если НЕ_СоздатьНовыйКонтрагентЕслиНеНайден Тогда
			Если НЕ СтрокаТТН.TYPE = 1 И НЕ СтрокаТТН.TYPE = 4 И Не ЗначениеЗаполнено(СтрокаТТН.Контрагент) Тогда 
				Сообщение = Новый СообщениеПользователю;
				пНомерСтроки = Формат(СтрокаТТН.НомерСтроки-1, "ЧГ=0");
				Сообщение.Текст = "სტრიქონში ნომერი " + Формат(СтрокаТТН.НомерСтроки, "ЧГ=0") + " ზედნადებისთვის № " +СтрокаТТН.WAYBILL_NUMBER+ " არ არის შევსებული კონტრაგენტი";
				Сообщение.Поле =  "Объект.ТоварныеНакладныеНаПортале[" + пНомерСтроки + "].Контрагент";
				Сообщение.УстановитьДанные(Объект);
				Сообщение.Сообщить();
				СтрокаТТН.ЕстьОшибки = Истина;
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		НомСтр = 0;
		//СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("WAYBILL_NUMBER", СтрокаТТН.WAYBILL_NUMBER));
		Если СтрокаТТН.WAYBILL_NUMBER = "" Тогда
			СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("ID", 				СтрокаТТН.ID));
		Иначе
			СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("WAYBILL_NUMBER",	СтрокаТТН.WAYBILL_NUMBER));
		КонецЕсли;
		Если СтрокиТоваров.Количество() > 0 Тогда
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				НомСтр = НомСтр +1;
				Если СтрокаТТН.ЭтаИмущество Тогда
					Если НЕ ЗначениеЗаполнено(СтрокаТовары.ВнеоборотныйАктив) Тогда
						Сообщение = Новый СообщениеПользователю;
						пНомерСтроки 	= Формат(СтрокаТТН.НомерСтроки-1, 		"ЧГ=0");
						пНомерСтрокиТЧ	= Формат(СтрокаТовары.НомерСтроки-1,	"ЧГ=0");
						Сообщение.Текст = "ზედნადებისთვის № " +СтрокаТовары.WAYBILL_NUMBER + " საქონლის ცხრილში სტრიქონში ნომერი " + Формат(НомСтр, "ЧГ=0") + " არ არის შევსებული ქონება";
						Сообщение.Поле =  "Объект.ТоварыНаПортале[" + пНомерСтрокиТЧ + "].ВнеоборотныйАктив";
						Сообщение.УстановитьДанные(Объект);
						Сообщение.Сообщить();
						СтрокаТТН.ЕстьОшибки = Истина;
						ЕстьОшибки = Истина;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
						Сообщение = Новый СообщениеПользователю;
						пНомерСтроки 	= Формат(СтрокаТТН.НомерСтроки-1, 		"ЧГ=0");
						пНомерСтрокиТЧ	= Формат(СтрокаТовары.НомерСтроки-1,	"ЧГ=0");
						Сообщение.Текст = "ზედნადებისთვის № " +СтрокаТовары.WAYBILL_NUMBER + " საქონლის ცხრილში სტრიქონში ნომერი " + Формат(НомСтр, "ЧГ=0") + " არ არის შევსებული ნომენკლატურა";
						Сообщение.Поле =  "Объект.ТоварыНаПортале[" + пНомерСтрокиТЧ + "].Номенклатура";
						Сообщение.УстановитьДанные(Объект);
						Сообщение.Сообщить();
						СтрокаТТН.ЕстьОшибки = Истина;
						ЕстьОшибки = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			пНомерСтроки = Формат(СтрокаТТН.НомерСтроки-1, "ЧГ=0");
			Сообщение.Текст = "ზედნადებისთვის № " +СтрокаТовары.WAYBILL_NUMBER + " საქონლის ცხრილი ცარიელია";
			Сообщение.Поле =  "Объект.ТоварныеНакладныеНаПортале[" + пНомерСтроки + "].НомерСтроки";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			СтрокаТТН.ЕстьОшибки = Истина;
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьТекстПодсказки()
	
	Если ДанныеНеСоответствуютФильтру Тогда
		впТекстПодсказки = НСтр("ka='ფილტრი არ არის აქტუალური, დააჭირეთ ღილაკს ""განახლება""';ru='Фильтр не актуален, нажмите кнопку ""Обновить""'");
		Элементы.ТоварныеНакладныеНаПортале.Подсказка 	= впТекстПодсказки;
		Элементы.ТоварыНаПортале.Подсказка 			= впТекстПодсказки;
	Иначе 
		Элементы.ТоварныеНакладныеНаПортале.Подсказка 	= "";
		Элементы.ТоварыНаПортале.Подсказка 			= "";
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьСнятьФлажки(знч_Загружать)
	Если знч_Загружать Тогда
		Для Каждого Стр Из Объект.ТоварныеНакладныеНаПортале Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Документ) Тогда
				Стр.Флаг = знч_Загружать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Стр Из Объект.ТоварныеНакладныеНаПортале Цикл 
			Стр.Флаг = знч_Загружать;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьСнятьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаПорталеПриАктивизацииЯчейки(Элемент)
	ТекЭлемент = Элементы.ТоварыНаПортале.ТекущийЭлемент;
	Если ТекЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекЭлемент.Имя = "ТоварыНаПорталеНоменклатура" Тогда
		ТекДанныеНакладной = Элементы.ТоварныеНакладныеНаПортале.ТекущиеДанные;
		Если ТекДанныеНакладной = Неопределено ИЛИ (ТекДанныеНакладной.Свойство("ЭтаИмущество") И ТекДанныеНакладной.ЭтаИмущество) Тогда
			Возврат;
		КонецЕсли;
		//Если НЕ ТекДанныеНакладной = Неопределено Тогда
		МассивТиповОперации = Новый Массив;
		Если ТекДанныеНакладной.TYPE = 1 ИЛИ ТекДанныеНакладной.TYPE = 4 ИЛИ ТекДанныеНакладной.TYPE = 5 Тогда
			МассивТиповОперации.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
		Иначе
			Если ТекДанныеНакладной.Состояние = "მიღებული" Тогда
				МассивТиповОперации.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
				МассивТиповОперации.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
			Иначе
				МассивТиповОперации.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
			КонецЕсли;
		КонецЕсли;
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипНоменклатуры", Новый ФиксированныйМассив(МассивТиповОперации));
		НовыйМассив = Новый Массив;
		НовыйМассив.Добавить(НовыйПараметр);
		ТекЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеНакладныеНаПорталеЭтаИмуществоПриИзменении(Элемент)
	
	ЭтаЭтаИмущество = Элементы.ТоварныеНакладныеНаПортале.ТекущиеДанные.ЭтаИмущество;
	Элементы.ТоварыНаПорталеВнеоборотныйАктив.Видимость = ЭтаЭтаИмущество;
	Элементы.ТоварыНаПорталеНоменклатура.Видимость 		= НЕ ЭтаЭтаИмущество;
	Элементы.ТоварыНаПорталеХарактеристика.Видимость 	= НЕ ЭтаЭтаИмущество;
	Элементы.ТоварыНаПорталеЕдиницаИзмерения.Видимость 	= НЕ ЭтаЭтаИмущество;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаПорталеХарактеристикаПриИзменении(Элемент)
	ОбновитьЦеныНоменклатуры(Элементы.ТоварыНаПортале.ТекущаяСтрока);
	ОбновитьЦеныПродаж(Элементы.ТоварыНаПортале.ТекущаяСтрока);
КонецПроцедуры
